GPassos01/espCam_imageAnalysis/esp32/sdkconfig.defaults
#
# Configurações ESP32-CAM - Sistema de Monitoramento de Enchentes
# Gabriel Passos - IGCE/UNESP 2025
#

# Configurações da placa ESP32-CAM
CONFIG_IDF_TARGET="esp32"
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y

# Configurações de memória - PSRAM CORRIGIDA
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SIZE_8MB=y
CONFIG_SPIRAM_CACHE_WORKAROUND=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Configurações da câmera
CONFIG_CAMERA_CORE0=y
CONFIG_CAMERA_DMA_BUFFER_SIZE_MAX=16384

# Configurações de WiFi
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=16
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_TX_BA_WIN=16

# Configurações de MQTT
CONFIG_MQTT_BUFFER_SIZE=32768
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
CONFIG_MQTT_CLIENT_SSL_VERIFY=n
CONFIG_MQTT_TASK_STACK_SIZE=8192

# Configurações de SPIFFS
CONFIG_SPIFFS_MAX_PARTITIONS=3
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y
CONFIG_SPIFFS_PAGE_CHECK=y

# Configurações de FreeRTOS
CONFIG_FREERTOS_UNICORE=y
CONFIG_FREERTOS_HZ=1000

# Configurações de log
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Configurações de rede
CONFIG_LWIP_TCP_MSS=1440
CONFIG_LWIP_TCP_MAXRTX=12
CONFIG_LWIP_TCP_SYNMAXRTX=6
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=32768
CONFIG_LWIP_TCP_WND_DEFAULT=32768
CONFIG_LWIP_TCP_RECVMBOX_SIZE=32
CONFIG_LWIP_UDP_RECVMBOX_SIZE=32

# Configurações de partições
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Configurações de compilação
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# Configurações específicas para ESP32-CAM
CONFIG_ESP32_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP32_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP32_WIFI_AMSDU_TX_ENABLED=n

# Configuração do tamanho do flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Configurações de WiFi
CONFIG_ESP_WIFI_SW_COEXIST_ENABLE=y
CONFIG_ESP_WIFI_CSI_ENABLED=y

# Configurações de MQTT
CONFIG_MQTT_PROTOCOL_311=y

# Configurações de rede
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y
CONFIG_LWIP_TCP_KEEP_CONNECTION_WHEN_IP_CHANGES=y

# Configurações de log
CONFIG_LOG_MAXIMUM_LEVEL=4

# Configurações de memória (sem PSRAM)
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096

# Configurações de partições
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESP_SPIFFS_CACHE_STATS=y
CONFIG_ESP_SPIFFS_PAGE_SIZE=256
CONFIG_ESP_SPIFFS_OBJ_NAME_LEN=32
CONFIG_ESP_SPIFFS_GC_MAX_RUNS=10
CONFIG_ESP_SPIFFS_GC_STATS=y

# Configurações de SPIFFS
CONFIG_ESPTOOLPY_FLASHSIZE="4MB" 